{"0":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Ontology"},"comment":{"type":"literal","xml:lang":"en","value":"Ontology is the philosophical study of the nature of being, becoming, existence or reality as well as the basic categories of being and their relations. Traditionally listed as a part of the major branch of philosophy known as metaphysics, ontology often deals with questions concerning what entities exist or may be said to exist and how such entities may be grouped, related within a hierarchy, and subdivided according to similarities and differences. Although ontology as a philosophical enterprise is highly theoretical, it also has practical application in information science and technology, such as ontology engineering."}}]}},"1":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Concept"},"comment":{"type":"literal","xml:lang":"en","value":"A concept is an abstract idea representing the fundamental characteristics of what it represents. Concepts arise as abstractions or generalisations from experience or the result of a transformation of existing ideas. The concept is instantiated (reified) by all of its actual or potential instances, whether these are things in the real world or other ideas. Concepts are treated in many if not most disciplines both explicitly, such as in linguistics, psychology, philosophy, etc., and implicitly, such as in mathematics, physics, etc. In informal use the word concept often just means any idea, but formally it involves the abstraction component."}}]}},"2":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Modular programming"},"comment":{"type":"literal","xml:lang":"en","value":"Modular programming is a software design technique that emphasizes separating the functionality of a program into independent, interchangeable modules, such that each contains everything necessary to execute only one aspect of the desired functionality. In object-oriented programming, the use of interfaces as an architectural pattern to construct modules is known as interface-based programming."}}]}},"3":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Measurement"},"comment":{"type":"literal","xml:lang":"en","value":"Measurement is the assignment of a number to a characteristic of an object or event, which can be compared with other objects or events. The scope and application of a measurement is dependent on the context and discipline. In the natural sciences and engineering, measurements do not apply to nominal properties of objects or events, which is consistent with the guidelines of the International vocabulary of metrology published by the International Bureau of Weights and Measures. However, in other fields such as statistics as well as the social and behavioral sciences, measurements can have multiple levels, which would include nominal, ordinal, interval, and ratio scales."}}]}},"4":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Homogeneity and heterogeneity"},"comment":{"type":"literal","xml:lang":"en","value":"Homogeneity and heterogeneity are concepts often used in the sciences and statistics relating to the uniformity in a substance or organism. A material or image that is homogeneous is uniform in composition or character (i.e. color, shape, size, weight, height, distribution, texture, language, income, disease, temperature, radioactivity, architectural design, etc.); one that is heterogeneous is distinctly nonuniform in one of these qualities."}}]}},"5":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Experiment"},"comment":{"type":"literal","xml:lang":"en","value":"An experiment is a procedure carried out to support, refute, or validate a hypothesis. Experiments provide insight into cause-and-effect by demonstrating what outcome occurs when a particular factor is manipulated. Experiments vary greatly in goal and scale, but always rely on repeatable procedure and logical analysis of the results. There also exist  natural experimental studies."}}]}},"6":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Evaluation"},"comment":{"type":"literal","xml:lang":"en","value":"Evaluation is asystematic determination of a subject's merit, worth and significance, using criteria governed by a set of standards. It can assist an organization, program, project or any other intervention or initiative to assess any aim, realisable concept/proposal, or any alternative, to help in decision-making; or to ascertain the degree of achievement or value in regard to the aim and objectives and results of any such action that has been completed. The primary purpose of evaluation, in addition to gaining insight into prior or existing initiatives, is to enable reflection and assist in the identification of future change."}}]}},"7":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Subroutine"},"comment":{"type":"literal","xml:lang":"en","value":"In computer programming, a subroutine is a sequence of program instructions that perform a specific task, packaged as a unit. This unit can then be used in programs wherever that particular task should be performed. Subprograms may be defined within programs, or separately in libraries that can be used by multiple programs. In different programming languages, a subroutine may be called a procedure, a function, a routine, a method, or a subprogram. The generic term callable unit is sometimes used."}}]}},"8":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Computation"},"comment":{"type":"literal","xml:lang":"en","value":"Computation is any type of calculation that follows a well-defined model understood and expressed as, for example, an algorithm. The study of computation is paramount to the discipline of computer science."}}]}},"9":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Data mapping"},"comment":{"type":"literal","xml:lang":"en","value":"In computing and data management, data mapping is the process of creating data element mappings between two distinct data models. Data mapping is used as a first step for a wide variety of data integration tasks including: For example, a company that would like to transmit and receive purchases and invoices with other companies might use data mapping to create data maps from a company's data to standardized ANSI ASC X12 messages for items such as purchase orders and invoices."}}]}},"10":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Graph theory"},"comment":{"type":"literal","xml:lang":"en","value":"In mathematics graph theory is the study of graphs, which are mathematical structures used to model pairwise relations between objects. A graph in this context is made up of vertices, nodes, or points which are connected by edges, arcs, or lines. A graph may be undirected, meaning that there is no distinction between the two vertices associated with each edge, or its edges may be directed from one vertex to another; see Graph (discrete mathematics) for more detailed definitions and for other variations in the types of graph that are commonly considered. Graphs are one of the prime objects of study in discrete mathematics."}}]}},"11":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Ranker"},"comment":{"type":"literal","xml:lang":"en","value":"Ranker is a social consumer web platform designed around collaborative and individual list-making and voting. All lists on Ranker are powered by linked datasets to power “connected listmaking” across millions rankable items on different verticals and topics."}}]}},"12":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Business process"},"comment":{"type":"literal","xml:lang":"en","value":"A business process or business method is a collection of related, structured activities or tasks that produce a specific service or product (serve a particular goal) for a particular customer or customers. It may often be visualized as a flowchart of a sequence of activities with interleaving decision points or as a Process Matrix of a sequence of activities with relevance rules based on data in the process."}}]}},"13":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Coupling constant"},"comment":{"type":"literal","xml:lang":"en","value":"In physics, a coupling constant or gauge coupling parameter is a number that determines the strength of the force exerted in an interaction. Usually, the Lagrangian or the Hamiltonian of a system describing an interaction can be separated into a kinetic part and an interaction part. The coupling constant determines the strength of the interaction part with respect to the kinetic part, or between two sectors of the interaction part. For example, the electric charge of a particle is a coupling constant that sits beside an interaction with two matter fields and one photon field (hence the common Feynman diagram with two arrows and one wavy line). Since photons carry electromagnetism, this coupling constant determines how strongly electrons feel such a force and has its value fixed by experime"}}]}},"14":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Data set"},"comment":{"type":"literal","xml:lang":"en","value":"A data set (or dataset, although this spelling is not present in many contemporary dictionaries) is a collection of data. Most commonly a data set corresponds to the contents of a single database table, or a single statistical data matrix, where every column of the table represents a particular variable, and each row corresponds to a given member of the data set in question. The data set lists values for each of the variables, such as height and weight of an object, for each member of the data set. Each value is known as a datum. The data set may comprise data for one or more members, corresponding to the number of rows."}}]}},"15":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Enterprise application integration"},"comment":{"type":"literal","xml:lang":"en","value":"Enterprise application integration (EAI) is the use of software and computer systems' architectural principles to integrate a set of enterprise computer applications."}}]}},"16":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Hydrogen"},"comment":{"type":"literal","xml:lang":"en","value":"(This article is about the chemistry of hydrogen. For the physics of atomic hydrogen, see Hydrogen atom. For other uses, see Hydrogen (disambiguation).) Hydrogen is a chemical element with chemical symbol H and atomic number 1. With an atomic weight of 1.00794 u, hydrogen is the lightest element on the periodic table. Its monatomic form (H) is the most abundant chemical substance in the Universe, constituting roughly 75% of all baryonic mass. Non-remnant stars are mainly composed of hydrogen in the plasma state. The most common isotope of hydrogen, termed protium (name rarely used, symbol 1H), has one proton and no neutrons."}}]}},"17":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Mathematical optimization"},"comment":{"type":"literal","xml:lang":"en","value":"In mathematics, computer science and operations research, mathematical optimization (alternatively, mathematical programming or simply, optimization) is the selection of a best element (with regard to some criterion) from some set of available alternatives."}}]}},"18":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Natural number"},"comment":{"type":"literal","xml:lang":"en","value":"In mathematics, the natural numbers are those used for counting (as in \"there are six coins on the table\") and ordering (as in \"this is the third largest city in the country\"). In common language, words used for counting are \"cardinal numbers\" and words used for ordering are \"ordinal numbers\". Properties of the natural numbers, such as divisibility and the distribution of prime numbers, are studied in number theory. Problems concerning counting and ordering, such as partitioning and enumerations, are studied in combinatorics."}}]}},"19":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Scientific literature"},"comment":{"type":"literal","xml:lang":"en","value":"Scientific literature comprises scholarly publications that report original empirical and theoretical work in the natural and social sciences, and within an academic field, often abbreviated as the literature. Academic publishing is the process of contributing the results of one's research into the literature, which often requires a peer-review process. Original scientific research published for the first time in scientific journals is called the primary literature. Patents and technical reports, for minor research results and engineering and design work (including computer software), can also be considered primary literature. Secondary sources include review articles (which summarize the findings of published studies to highlight advances and new lines of research) and books (for large pr"}}]}},"20":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Semantic similarity"},"comment":{"type":"literal","xml:lang":"en","value":"Semantic similarity is a metric defined over a set of documents or terms, where the idea of distance between them is based on the likeness of their meaning or semantic content as opposed to similarity which can be estimated regarding their syntactical representation (e.g. their string format). These are mathematical tools used to estimate the strength of the semantic relationship between units of language, concepts or instances, through a numerical description obtained according to the comparison of information supporting their meaning or describing their nature. The term semantic similarity is often confused with semantic relatedness. Semantic relatedness includes any relation between two terms, while semantic similarity only includes \"is a\" relations.For example, \"car\" is similar to \"bus"}}]}},"21":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Upper ontology"},"comment":{"type":"literal","xml:lang":"en","value":"In information science, an upper ontology (also known as a top-level ontology or foundation ontology) is an ontology (in the sense used in information science) which consists of very general terms (such as \"object\", \"property\", \"relation\") that are common across all domains. An important function of an upper ontology is to support broad semantic interoperability among a large number of domain-specific ontologies by providing a common starting point for the formulation of definitions. Terms in the domain ontology are ranked \"under\" the terms in the upper ontology, and the former stand to the latter in subclass relations."}}]}},"22":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Centrality"},"comment":{"type":"literal","xml:lang":"en","value":"In graph theory and network analysis, indicators of centrality identify the most important vertices within a graph. Applications include identifying the most influential person(s) in a social network, key infrastructure nodes in the Internet or urban networks, and super-spreaders of disease. Centrality concepts were first developed in social network analysis, and many of the terms used to measure centrality reflect their sociological origin.They should not be confused with node influence metrics, which seek to quantify the influence of every node in the network."}}]}},"23":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Domain of a function"},"comment":{"type":"literal","xml:lang":"en","value":"In mathematics, and more specifically in naive set theory, the domain of definition (or simply the domain) of a function is the set of \"input\" or argument values for which the function is defined. That is, the function provides an \"output\" or value for each member of the domain. Conversely, the set of values the function takes on as output is termed the image of the function, which is sometimes also referred to as the range of the function."}}]}},"24":{"head":{"vars":["label","comment"]},"results":{"bindings":[{"label":{"type":"literal","xml:lang":"en","value":"Group cohesiveness"},"comment":{"type":"literal","xml:lang":"en","value":"Group cohesiveness (also called group cohesion and social cohesion) arises when bonds link members of a social group to one another and to the group as a whole. Although cohesion is a multi-faceted process, it can be broken down into four main components: social relations, task relations, perceived unity, and emotions. Members of strongly cohesive groups are more inclined to participate readily and to stay with the group."}}]}}}